In [3]:
import pandas as pd

# load data
female_lfp = pd.read_csv('data/female-labor-force-participation-rates.csv')

# Rename column headers
female_lfp.rename(columns={'Labor force participation rate, female (% of female population ages 15+) (modeled ILO estimate)': 'Particpation', 'Entity': 'Location'}, inplace=True)

# Display first five rows 
female_lfp.head()

      Location Code  Year  Particpation
0  Afghanistan  AFG  1991        15.635
1  Afghanistan  AFG  1992        15.698
2  Afghanistan  AFG  1993        15.715
3  Afghanistan  AFG  1994        15.726
4  Afghanistan  AFG  1995        15.796

In [4]:
# Remove duplicate rows
u_female_lfp = female_lfp.drop_duplicates()

#count of rows in original data frame
row_count = len(female_lfp)

# count of rows in data frame with duplicates dropped
u_row_count = len(u_female_lfp)

# comparing the two row counts to see if there were any duplicates removed.
print(f"Number of rows: {row_count}"  f"\nNumber of unique rows: {u_row_count}")

Number of rows: 6431
Number of unique rows: 6431

In [5]:
#change data types
ud_female_lfp = u_female_lfp.convert_dtypes()


#compare data types
print(f"Old Data Types: \n{u_female_lfp.dtypes}\n")
print(f"New Data Types: \n{ud_female_lfp.dtypes}")

Old Data Types:
Location         object
Code             object
Year              int64
Particpation    float64
dtype: object

New Data Types:
Location        string[python]
Code            string[python]
Year                     Int64
Particpation           Float64
dtype: object

In [6]:
#identify null values
null_rows = ud_female_lfp[ud_female_lfp.isna().any(axis=1)]

#show count of null values per column
print(ud_female_lfp.isnull().sum()) 

#export null values to csv for review
null_rows.to_csv("data/nullrows.csv")

Location          0
Code            416
Year              0
Particpation      0
dtype: int64

In [7]:
#filter by null values in the Code column
null_rows = ud_female_lfp[pd.isnull(ud_female_lfp["Code"])]

# Display first five rows 
null_rows.head()

                        Location  Code  Year  Particpation
1536  East Asia and Pacific (WB)  <NA>  1991     66.366035
1537  East Asia and Pacific (WB)  <NA>  1992      66.24243
1538  East Asia and Pacific (WB)  <NA>  1993      65.92144
1539  East Asia and Pacific (WB)  <NA>  1994      65.88117
1540  East Asia and Pacific (WB)  <NA>  1995      65.73217

In [15]:
#replace  na values with location value
ud_female_lfp['Code'] = ud_female_lfp['Code'].fillna(ud_female_lfp['Location'])

#check for null values again
null_rows = ud_female_lfp[pd.isnull(ud_female_lfp["Code"])]

# Display first five rows 
null_rows.head()

#yay no null values!

Empty DataFrame
Columns: [Location, Code, Year, Particpation]
Index: []

In [17]:
# let's load another piece of data
contnients = pd.read_csv('data/continents-according-to-our-world-in-data.csv')

# Rename column headers
contnients.rename(columns={'World regions according to OWID': 'Continent', 'Entity': 'Location'}, inplace=True)

# Display first five rows 
contnients.head()

         Location Code  Year Continent
0     Afghanistan  AFG  2023      Asia
1   Aland Islands  ALA  2023    Europe
2         Albania  ALB  2023    Europe
3         Algeria  DZA  2023    Africa
4  American Samoa  ASM  2023   Oceania

In [18]:
# Remove duplicate rows
u_contnients = contnients.drop_duplicates()

#count of rows in original data frame
row_count = len(contnients)

# count of rows in data frame with duplicates dropped
u_row_count = len(u_contnients)

# comparing the two row counts to see if there were any duplicates removed.
print(f"Number of rows: {row_count}"  f"\nNumber of unique rows: {u_row_count}")

Number of rows: 271
Number of unique rows: 271

In [19]:
#change data types
ud_contnients = u_contnients.convert_dtypes()


#compare data types
print(f"Old Data Types: \n{u_contnients.dtypes}\n")
print(f"New Data Types: \n{ud_contnients.dtypes}")

Old Data Types:
Location     object
Code         object
Year          int64
Continent    object
dtype: object

New Data Types:
Location     string[python]
Code         string[python]
Year                  Int64
Continent    string[python]
dtype: object

In [23]:
#identify null values
null_rows_contnients = ud_contnients[ud_contnients.isna().any(axis=1)]

#show count of null values per column
print(ud_contnients.isnull().sum()) 

#export null values to csv for review
null_rows_contnients.to_csv("data/nullrowscontnients.csv")

Location      0
Code         14
Year          0
Continent     0
dtype: int64

In [22]:
#filter by null values in the Code column
null_rows = ud_contnients[pd.isnull(ud_contnients["Code"])]

# Display first five rows 
null_rows.head()

                               Location  Code  Year      Continent
61       Democratic Republic of Vietnam  <NA>  2023           Asia
66           Duchy of Modena and Reggio  <NA>  2023         Europe
67          Duchy of Parma and Piacenza  <NA>  2023         Europe
81  Federal Republic of Central America  <NA>  2023  North America
93                 Grand Duchy of Baden  <NA>  2023         Europe

In [24]:
#drop null values
ud_contnients.dropna()

                    Location      Code  Year Continent
0                Afghanistan       AFG  2023      Asia
1              Aland Islands       ALA  2023    Europe
2                    Albania       ALB  2023    Europe
3                    Algeria       DZA  2023    Africa
4             American Samoa       ASM  2023   Oceania
..                       ...       ...   ...       ...
266      Yemen Arab Republic  OWID_YAR  2023      Asia
267  Yemen People's Republic  OWID_YPR  2023      Asia
268               Yugoslavia  OWID_YGS  2023    Europe
269                   Zambia       ZMB  2023    Africa
270                 Zimbabwe       ZWE  2023    Africa

[257 rows x 4 columns]